# Lamar Core
GNU General Public License (GPL) Copyright © 2024-2025 Lamar Core

โปรเจกต์นี้ได้รับการเผยแพร่ภายใต้เงื่อนไขดังต่อไปนี้:
1. Source code นี้เผยแพร่ภายใต้เงื่อนไขของ [GNU General Public License (GPL)](https://www.gnu.org/licenses/gpl-3.0.html)
2. คุณสามารถทำซ้ำ ดัดแปลง แก้ไข หรือแจกจ่าย source code นี้ได้อย่างอิสระ
3. หากมีการดัดแปลงหรือแก้ไขโค้ดนี้เพื่อใช้ในโปรเจกต์อื่น ๆ คุณต้องเผยแพร่โค้ดของโปรเจกต์นั้นในรูปแบบ open source ตามเงื่อนไขของ [GNU General Public License (GPL)](https://www.gnu.org/licenses/gpl-3.0.html)
4. การแจกจ่าย source code นี้ ไม่ว่าจะดัดแปลงหรือไม่ก็ตาม ต้องแนบเอกสารลิขสิทธิ์นี้มาด้วยทุกครั้ง
5. การไม่ปฏิบัติตามเงื่อนไขเหล่านี้ถือเป็นการละเมิดลิขสิทธิ์ และอาจถูกดำเนินการทางกฎหมาย

โปรดเคารพสิทธิ์ของผู้สร้าง หากมีข้อสงสัย กรุณาติดต่อ Discord: loma_0531

การละเมิดเงื่อนไขนี้อาจส่งผลให้มีการดำเนินการทางกฎหมายตามที่กฎหมายลิขสิทธิ์กำหนด

เอกสารเพิ่มเติม: [GNU General Public License (GPL)](https://www.gnu.org/licenses/gpl-3.0.html)
